caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
    // binding the TCP socket to the TCP server address
    iStatus = sl_Bind(iSockID, sa, iAddrSize);

    if( iStatus < 0 )
    {
        // error
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

    // putting the socket for listening to the incoming TCP connection
    iStatus = sl_Listen(iSockID, 2);
    if( iStatus < 0 )
    {
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }
    else
    {
    	Report("Prepare Connection\n\r");

		SL_SOCKET_FD_ZERO(&readsds);
		SL_SOCKET_FD_SET(iSockID + 1, &readsds);
		Status = sl_Select(iSockID + 1, &readsds, &writesds, NULL, &timeout);
		if(Status > 0)
		{
			Report("Connection readsds [%d] writesds[%d] Status[%d] \n\r", readsds, writesds, Status);
		}
		else if(Status == 0)
		{
			Report("Connection Timeout [%d]s\n\r",timeout.tv_sec);
			sl_Close(iSockID);
			_ASSERT_ON_ERROR(LISTEN_ERROR);
			system_reboot();
		}
        else
        {
			Report("connection error (code : %d)\r\n", Status);
			sl_Close(iSockID);
			_ASSERT_ON_ERROR(LISTEN_ERROR);
			system_reboot();
        }
    }
    if(nb == TRUE)
    {
//    	lNonBlocking = TRUE;
    	lNonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	BlockingOption.NonBlockingEnabled = 0;
    	Report("KEEP ALIVE TIME\n\r");
        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                                &BlockingOption, sizeof(BlockingOption));
//        TimeOut = 120;
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVETIME,( _u8*) &TimeOut, sizeof(TimeOut));
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVE,( _u8*) &enableOption, sizeof(enableOption));
        if(iStatus < 0)
        {
        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            return(-1);
        }
        iNewSockID = SL_ERROR_BSD_EAGAIN;
    }

    // waiting for an incoming TCP connection
    while( iNewSockID < 0 )
    {
        // accepts a connection form a TCP client, if there is any
        // otherwise returns SL_EAGAIN
		iNewSockID = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
		UART_PRINT("iNewSockID:%d\n\r",iNewSockID);

        if( (iNewSockID == SL_ERROR_BSD_EAGAIN) && nb == TRUE)
        {
        	UART_PRINT("Sleep\n\r");
        	sleep(1);
        }
        else if( iNewSockID < 0 )
        {
            // error
        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iNewSockID, __FUNCTION__, SL_SOCKET_ERROR);
            sl_Close(iNewSockID);
            sl_Close(iSockID);
            return(-1);
        }

    }
    UART_PRINT("Connected to client: ");
    sAddr.in4.sin_addr.s_addr = sl_Htonl(sAddr.in4.sin_addr.s_addr);
    PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
    UART_PRINT("\n\r");
    // waits for 1000 packets from the connected TCP client
    int i = 0;
	if(tx == 1)
	{
		int32_t buflen;
		uint32_t sent_bytes = 0;
		uint32_t bytes_to_send = (1000 * BUF_LEN);

		while(sent_bytes < bytes_to_send)
		{
		if(bytes_to_send - sent_bytes >= BUF_LEN)
		{
			buflen = BUF_LEN;
		}
		else
		{
			buflen = bytes_to_send - sent_bytes;
		}

		/* Send packets to server */
		iStatus = sl_Send(iSockID, &g_cBsdBuf1, buflen, 0);
		//            status = sl_Send(newsock, &app_CB.CmdBuffer, buflen, 0);
		if((iStatus == SL_ERROR_BSD_EAGAIN) && (TRUE == 1))
		{
			sleep(1);
			continue;
		}
		else if(iStatus < 0)
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
			sl_Close(iNewSockID);
			sl_Close(iSockID);
			return(-1);
		}
		i++;
		sent_bytes += iStatus;
		}

		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r",i,
			   sent_bytes, &app_CB.CmdBuffer[30]);
	}
	else
	{
		uint32_t rcvd_bytes = 0;

		while(rcvd_bytes < (1000 * BUF_LEN))
		{
			iStatus = sl_Recv(iNewSockID, &g_cBsdBuf1, sizeof(g_cBsdBuf1),0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Client closed the connection \n\r");
				break;
			}

			rcvd_bytes += iStatus;

		}
		iStatus = sl_Send(iNewSockID, "ACK", strlen("ACK"), 0 );
		if( strlen("ACK") != iStatus )
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, BSD_SOCKET_ERROR);
		}
		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully \n\r",
				   (rcvd_bytes / BUF_LEN), rcvd_bytes, &g_cBsdBuf1);
		memset(g_cBsdBuf1, 0x0, sizeof(g_cBsdBuf1));

	}

	iStatus = sl_Recv(iNewSockID, &g_cBsdBuf1, sizeof(g_cBsdBuf1),0);

	if(0 == iStatus)
	{
		UART_PRINT("Status [%d] function[%s]\n\r", iStatus, __FUNCTION__);
		iStatus = sl_Close(iNewSockID);
		ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

		iStatus = sl_Close(iSockID);
		ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
	}

	return(0);
}
void PrintIPAddress(unsigned char ipv6,
                    void *ip)
{
    uint32_t        *pIPv4;
    uint8_t         *pIPv6;
    int32_t          i=0;

    if(!ip)
    {
        return;
    }

    if(ipv6)
    {
        pIPv6 = (uint8_t*) ip;

        for(i = 0; i < 14; i+=2)
        {
            UART_PRINT("%02x%02x:", pIPv6[i], pIPv6[i+1]);
        }

        UART_PRINT("%02x%02x", pIPv6[i], pIPv6[i+1]);
    }
    else
    {
        pIPv4 = (uint32_t*)ip;
        UART_PRINT("%d.%d.%d.%d",
                    SL_IPV4_BYTE(*pIPv4,3),
                    SL_IPV4_BYTE(*pIPv4,2),
                    SL_IPV4_BYTE(*pIPv4,1),
                    SL_IPV4_BYTE(*pIPv4,0));
    }
    return;
}
int32_t ipv4AddressParse(char *str, uint32_t *ipv4ip)
{
    volatile int32_t i = 0;
    uint32_t n;
    uint32_t ipv4Address = 0;
    char             *token;

    token = strtok(str, ".");
    if(token)
    {
        n = (int)strtoul(token, 0, 10);
    }
    else
    {
        return(-1);
    }

    while(i < 4)
    {
       if((token != NULL) && (n < 256))
       {
           ipv4Address |= n;
           if(i < 3)
           {
               ipv4Address = ipv4Address << 8;
           }
           token=strtok(NULL,".");
           if (token)
           {
               n = (int)strtoul(token, 0, 10);
           }
           i++;
       }
       else
       {
           return -1;
       }
    }
    *ipv4ip = ipv4Address;
/*    ipv4ip = &ipv4Address;
    UART_PRINT("ipv4ip parser:%x\n\r", *ipv4ip);*/
    return(0);
}

